garyPenhook/PyAvrOCD/svd/attiny804.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EVSYS</name>
      <description>Event System</description>
      <baseAddress>0x00800180</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x12</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x22</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ASYNCCH0</name>
          <description>Asynchronous Channel 0 Generator Selection</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH0</name>
              <description>Asynchronous Channel 0 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN0</name>
                  <description>Asynchronous Event from Pin PA0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN1</name>
                  <description>Asynchronous Event from Pin PA1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN2</name>
                  <description>Asynchronous Event from Pin PA2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN3</name>
                  <description>Asynchronous Event from Pin PA3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN4</name>
                  <description>Asynchronous Event from Pin PA4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN5</name>
                  <description>Asynchronous Event from Pin PA5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN6</name>
                  <description>Asynchronous Event from Pin PA6</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN7</name>
                  <description>Asynchronous Event from Pin PA7</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and debug interface</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCCH1</name>
          <description>Asynchronous Channel 1 Generator Selection</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH1</name>
              <description>Asynchronous Channel 1 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable custom logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable custom logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Asynchronous Event from Pin PB0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Asynchronous Event from Pin PB1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Asynchronous Event from Pin PB2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Asynchronous Event from Pin PB3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Asynchronous Event from Pin PB4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Asynchronous Event from Pin PB5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Asynchronous Event from Pin PB6</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Asynchronous Event from Pin PB7</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCSTROBE</name>
          <description>Asynchronous Channel Strobe</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ASYNCUSER0</name>
          <description>Asynchronous User Ch 0 Input Selection - TCB0</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER0</name>
              <description>Asynchronous User Ch 0 Input Selection - TCB0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER1</name>
          <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER1</name>
              <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER10</name>
          <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER10</name>
              <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER11</name>
          <description>Asynchronous User Ch 11 Input Selection - TCB1</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER11</name>
              <description>Asynchronous User Ch 11 Input Selection - TCB1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER12</name>
          <description>Asynchronous User Ch 12 Input Selection - ADC1</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER12</name>
              <description>Asynchronous User Ch 12 Input Selection - ADC0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER2</name>
          <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER2</name>
              <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER3</name>
          <description>Asynchronous User Ch 3 Input Selection - CCL LUT1 Event 0</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER3</name>
              <description>Asynchronous User Ch 3 Input Selection - CCL LUT1 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
